const data: SearchResult[] = [
  {
    "class": "Алканы и алкильные фрагменты",
    "group": "C–H вал.",
    "range": "3000—2840",
    "intensity": "переменная",
    "comments": "За пределами обычного диапазона проявляются валентные колебания C–H для простых метиловых эфиров (2850—2815), других простых эфиров (2880—2830), оксирана и азиридина (3050—3000), аминов (2820—2780), циклопропана и циклогексана (3100—3050, 3035—2995).",
    "filterRanges": [
      [
        2840,
        3000
      ]
    ]
  },
  {
    "class": "Алканы и алкильные фрагменты",
    "group": "CH3  деф.",
    "range": "1470—1430",
    "intensity": "средняя",
    "comments": "Полосы поглощения в области 1250—800 практического значения не имеют.",
    "filterRanges": [
      [
        1430,
        1470
      ]
    ]
  },
  {
    "class": "Алканы и алкильные фрагменты",
    "group": "CH3  деф.",
    "range": "1395—1365",
    "intensity": "средняя",
    "comments": "Полосы поглощения в области 1250—800 практического значения не имеют.",
    "filterRanges": [
      [
        1365,
        1395
      ]
    ]
  },
  {
    "class": "Алканы и алкильные фрагменты",
    "group": "CH3  деф.",
    "range": "1250—800",
    "intensity": "переменная",
    "comments": "Полосы поглощения в области 1250—800 практического значения не имеют.",
    "filterRanges": [
      [
        800,
        1250
      ]
    ]
  },
  {
    "class": "Алканы и алкильные фрагменты",
    "group": "CH2  деф.",
    "range": "1475—1450",
    "intensity": "средняя",
    "comments": "",
    "filterRanges": [
      [
        1450,
        1475
      ]
    ]
  },
  {
    "class": "Алканы и алкильные фрагменты",
    "group": "CH2  деф.",
    "range": "770—720",
    "intensity": "средняя",
    "comments": "",
    "filterRanges": [
      [
        720,
        770
      ]
    ]
  },
  {
    "class": "Алканы и алкильные фрагменты",
    "group": "C–D  вал.",
    "range": "2200—2080",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        2080,
        2200
      ]
    ]
  },
  {
    "class": "Алкены",
    "group": "=CH2  вал.",
    "range": "3095—3075",
    "intensity": "средняя",
    "comments": "Часто несколько полос.",
    "filterRanges": [
      [
        3075,
        3095
      ]
    ]
  },
  {
    "class": "Алкены",
    "group": "=CH  вал.",
    "range": "3040—3010",
    "intensity": "средняя",
    "comments": "Часто несколько полос.",
    "filterRanges": [
      [
        3010,
        3040
      ]
    ]
  },
  {
    "class": "Алкены",
    "group": "=CH  деф.",
    "range": "1420—1290, 1005—675",
    "intensity": "—",
    "comments": "Внеплоскостные колебания практического значения не имеют. 1420—1290 (  плоск.) 1005—675 (  внеплоск.)",
    "filterRanges": [
      [
        1290,
        1420
      ],
      [
        675,
        1005
      ]
    ]
  },
  {
    "class": "Алкены",
    "group": "С=С  вал.",
    "range": "1690—1635",
    "intensity": "переменная",
    "comments": "Для транс-дизамещённых алкенов — 1690—1665 слабой интенсивности, для цис-изомеров — 1665—1635. Для три- и тетразамещённых алкенов находится в области 1690—1650 и часто отсутствует. Частота понижается при сопряжении с другой С=С-связью (1650, 1600), тройной связью (1600), нитрильной группой (1620), карбонильной группой (1630), бензольным кольцом (1630).",
    "filterRanges": [
      [
        1635,
        1690
      ]
    ]
  },
  {
    "class": "Алкины",
    "group": "≡C–H  вал.",
    "range": "3340—3250",
    "intensity": "сильная",
    "comments": "В той же области находятся полосы валентных колебаний O–H и N–H.",
    "filterRanges": [
      [
        3250,
        3340
      ]
    ]
  },
  {
    "class": "Алкины",
    "group": "C≡C  вал.",
    "range": "2260—2100",
    "intensity": "слабая",
    "comments": "Для терминальных алкинов колебания тройной связи проявляются в низкочастотном конце данного диапазона. В симметричных структурах полоса часто отсутствует.",
    "filterRanges": [
      [
        2100,
        2260
      ]
    ]
  },
  {
    "class": "Алкины",
    "group": "≡C–H  деф.",
    "range": "700—600",
    "intensity": "сильная",
    "comments": "При 1370—1220 проявляется широкий и слабый обертон этого колебания.",
    "filterRanges": [
      [
        600,
        700
      ]
    ]
  },
  {
    "class": "Алициклические соединения",
    "group": "C–H  вал.",
    "range": "3090—2860",
    "intensity": "сильная",
    "comments": "",
    "filterRanges": [
      [
        2860,
        3090
      ]
    ]
  },
  {
    "class": "Алициклические соединения",
    "group": "H–C–H  деф.",
    "range": "1470—1430",
    "intensity": "слабая",
    "comments": "",
    "filterRanges": [
      [
        1430,
        1470
      ]
    ]
  },
  {
    "class": "Алициклические соединения",
    "group": "C=C  деф.",
    "range": "1780—1610",
    "intensity": "переменная",
    "comments": "",
    "filterRanges": [
      [
        1610,
        1780
      ]
    ]
  },
  {
    "class": "Ароматические углеводороды",
    "group": "C–H  вал.",
    "range": "3080—3030",
    "intensity": "",
    "comments": "Часто наблюдается набор полос. В эту же область попадают валентные колебания связей C–H в алкенах.",
    "filterRanges": [
      [
        3030,
        3080
      ]
    ]
  },
  {
    "class": "Ароматические углеводороды",
    "group": "C–C",
    "range": "1625—1575, 1525—1475",
    "intensity": "средняя",
    "comments": "Часто по две полосы.",
    "filterRanges": [
      [
        1575,
        1625
      ],
      [
        1475,
        1525
      ]
    ]
  },
  {
    "class": "Ароматические углеводороды",
    "group": "комбинационная",
    "range": "2000—1650",
    "intensity": "очень слабая",
    "comments": "По характеру поглощения в данной области устанавливают тип замещения ароматического кольца.",
    "filterRanges": [
      [
        1650,
        2000
      ]
    ]
  },
  {
    "class": "Ароматические углеводороды",
    "group": "C–H  деф.",
    "range": "≈0",
    "intensity": "переменнаясильная",
    "comments": "Внеплоскостные полосы поглощения используются для определения типа замещения в ароматических соединениях.",
    "filterRanges": [
      [
        0,
        10
      ]
    ]
  },
  {
    "class": "Фторорганические соединения",
    "group": "C–F  вал.",
    "range": "1400—1000",
    "intensity": "сильная",
    "comments": "Часто наблюдается более одной полосы за счёт наличия поворотных изомеров.",
    "filterRanges": [
      [
        1000,
        1400
      ]
    ]
  },
  {
    "class": "Фторорганические соединения",
    "group": "S–F  вал.",
    "range": "815—755",
    "intensity": "сильная",
    "comments": "",
    "filterRanges": [
      [
        755,
        815
      ]
    ]
  },
  {
    "class": "Фторорганические соединения",
    "group": "P–F  вал.",
    "range": "1110—760",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        760,
        1110
      ]
    ]
  },
  {
    "class": "Фторорганические соединения",
    "group": "Si–F  вал.",
    "range": "980—820",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        820,
        980
      ]
    ]
  },
  {
    "class": "Фторорганические соединения",
    "group": "B–F  вал.",
    "range": "1500—800",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        800,
        1500
      ]
    ]
  },
  {
    "class": "Хлорорганические соединения",
    "group": "C–Cl  вал.",
    "range": "1100—1020, 830—600",
    "intensity": "сильная",
    "comments": "",
    "filterRanges": [
      [
        1020,
        1100
      ],
      [
        600,
        830
      ]
    ]
  },
  {
    "class": "Хлорорганические соединения",
    "group": "C–Cl  деф.",
    "range": "400—280",
    "intensity": "средняя",
    "comments": "",
    "filterRanges": [
      [
        280,
        400
      ]
    ]
  },
  {
    "class": "Хлорорганические соединения",
    "group": "P–Cl  вал.",
    "range": "<600",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        0,
        600
      ]
    ]
  },
  {
    "class": "Хлорорганические соединения",
    "group": "Si–Cl  вал.",
    "range": "<625",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        0,
        625
      ]
    ]
  },
  {
    "class": "Хлорорганические соединения",
    "group": "B–Cl  вал.",
    "range": "1100—650",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        650,
        1100
      ]
    ]
  },
  {
    "class": "Броморганические соединения",
    "group": "C–Br  вал.",
    "range": "1080—1000, 700—500",
    "intensity": "сильная",
    "comments": "",
    "filterRanges": [
      [
        1000,
        1080
      ],
      [
        500,
        700
      ]
    ]
  },
  {
    "class": "Броморганические соединения",
    "group": "C–Br  деф.",
    "range": "350—250",
    "intensity": "средняя",
    "comments": "",
    "filterRanges": [
      [
        250,
        350
      ]
    ]
  },
  {
    "class": "Иодорганические соединения",
    "group": "C–I  вал.",
    "range": "650—450",
    "intensity": "сильная",
    "comments": "Две или более полос.",
    "filterRanges": [
      [
        450,
        650
      ]
    ]
  },
  {
    "class": "Иодорганические соединения",
    "group": "C–I  деф.",
    "range": "300—50",
    "intensity": "средняя",
    "comments": "",
    "filterRanges": [
      [
        50,
        300
      ]
    ]
  },
  {
    "class": "Спирты и фенолы",
    "group": "O–H  вал.",
    "range": "3650—3200",
    "intensity": "переменная",
    "comments": "Полосы поглощения гидроксильных групп, связанных водородными связями, имеют увеличенную ширину и смещены в более низкочастотную область (3550—3450) по сравнению со свободными (3650—3590).",
    "filterRanges": [
      [
        3200,
        3650
      ]
    ]
  },
  {
    "class": "Спирты и фенолы",
    "group": "O–H  деф.  плоск.",
    "range": "1450—1200",
    "intensity": "средняя",
    "comments": "Практическая значимость отсутствует.",
    "filterRanges": [
      [
        1200,
        1450
      ]
    ]
  },
  {
    "class": "Спирты и фенолы",
    "group": "C–O  вал.",
    "range": "1260—970",
    "intensity": "сильная",
    "comments": "Первичные спирты: 1075—1000, вторичные спирты: 1125—1000, третичные спирты: 1210—1100, фенолы: 1275—1150.",
    "filterRanges": [
      [
        970,
        1260
      ]
    ]
  },
  {
    "class": "Спирты и фенолы",
    "group": "O–H  деф.  внеплоск.",
    "range": "<700",
    "intensity": "средняя",
    "comments": "Практическая значимость отсутствует.",
    "filterRanges": [
      [
        0,
        700
      ]
    ]
  },
  {
    "class": "Простые эфиры и ацетали",
    "group": "C–O–C  вал.  асим.",
    "range": "1310—1000",
    "intensity": "сильная",
    "comments": "Иногда полоса расщепляется на 3, 4 или 5 компонент.",
    "filterRanges": [
      [
        1000,
        1310
      ]
    ]
  },
  {
    "class": "Простые эфиры и ацетали",
    "group": "C–O–C  вал.  сим.",
    "range": "1055—870",
    "intensity": "сильная",
    "comments": "Иногда несколько полос.",
    "filterRanges": [
      [
        870,
        1055
      ]
    ]
  },
  {
    "class": "Пероксиды",
    "group": "O–O–H  вал.",
    "range": "3450—3200",
    "intensity": "переменная",
    "comments": "",
    "filterRanges": [
      [
        3200,
        3450
      ]
    ]
  },
  {
    "class": "Пероксиды",
    "group": "C–O–O  вал.",
    "range": "1200—1000",
    "intensity": "сильная",
    "comments": "",
    "filterRanges": [
      [
        1000,
        1200
      ]
    ]
  },
  {
    "class": "Пероксиды",
    "group": "O–O  вал.",
    "range": "1000—800",
    "intensity": "средняя или слабая",
    "comments": "Отнесение ненадёжно.",
    "filterRanges": [
      [
        800,
        1000
      ]
    ]
  },
  {
    "class": "Амины",
    "group": "NH2  вал.",
    "range": "3500—3300",
    "intensity": "переменная",
    "comments": "Первичные амины дают в этой области две узкие полосы. При образовании водородной связи частота колебаний уменьшается, а полосы уширяются. Иногда свободная и связанная водородными связями формы наблюдаются одновременно.",
    "filterRanges": [
      [
        3300,
        3500
      ]
    ]
  },
  {
    "class": "Амины",
    "group": "NH  вал.",
    "range": "3450—3300",
    "intensity": "переменная",
    "comments": "Вторичные амины дают лишь одну полосу. При образовании водородной связи частота колебаний уменьшается, а полосы уширяются. Иногда свободная и связанная водородными связями формы наблюдаются одновременно.",
    "filterRanges": [
      [
        3300,
        3450
      ]
    ]
  },
  {
    "class": "Амины",
    "group": "NH3+, NH2+, NH+  вал.",
    "range": "3000—2000",
    "intensity": "средняя",
    "comments": "Широкая, высокоструктурированная полоса.",
    "filterRanges": [
      [
        2000,
        3000
      ]
    ]
  },
  {
    "class": "Амины",
    "group": "NH2  деф.",
    "range": "1650—1590, 850—700",
    "intensity": "средняя или слабая",
    "comments": "",
    "filterRanges": [
      [
        1590,
        1650
      ],
      [
        700,
        850
      ]
    ]
  },
  {
    "class": "Амины",
    "group": "NH  деф.",
    "range": "1650—1550, 850—700",
    "intensity": "слабая",
    "comments": "",
    "filterRanges": [
      [
        1550,
        1650
      ],
      [
        700,
        850
      ]
    ]
  },
  {
    "class": "Амины",
    "group": "NH3+, NH2+, NH+  деф.",
    "range": "1600—1460",
    "intensity": "средняя",
    "comments": "Часто наблюдается более одной полосы. Для алифатических аминов полоса слабая.",
    "filterRanges": [
      [
        1460,
        1600
      ]
    ]
  },
  {
    "class": "Амины",
    "group": "C–N  вал.",
    "range": "1400—1000",
    "intensity": "средняя",
    "comments": "Практическое значение отсутствует.",
    "filterRanges": [
      [
        1000,
        1400
      ]
    ]
  },
  {
    "class": "Нитросоединения и нитрозосоединения",
    "group": "NO2  вал.  асим.",
    "range": "1660—1490",
    "intensity": "очень сильная",
    "comments": "",
    "filterRanges": [
      [
        1490,
        1660
      ]
    ]
  },
  {
    "class": "Нитросоединения и нитрозосоединения",
    "group": "NO2  вал.  сим.",
    "range": "1390—1260",
    "intensity": "сильная",
    "comments": "",
    "filterRanges": [
      [
        1260,
        1390
      ]
    ]
  },
  {
    "class": "Нитросоединения и нитрозосоединения",
    "group": "N=O  вал.",
    "range": "1680—1450 (мономеры), 1420—1250 (димеры)",
    "intensity": "очень сильная",
    "comments": "1680—1450 (мономеры), 1420—1250 (димеры)",
    "filterRanges": [
      [
        1450,
        1680
      ],
      [
        1250,
        1420
      ]
    ]
  },
  {
    "class": "Нитросоединения и нитрозосоединения",
    "group": "C–N  вал.",
    "range": "≈850 (алиф. нитрозосоединения), ≈1100 (аром. нитрозосоединения)",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        840,
        860
      ],
      [
        1090,
        1110
      ]
    ]
  },
  {
    "class": "Имины и оксимы",
    "group": "C=N  вал.",
    "range": "1690—1520",
    "intensity": "обычно сильная",
    "comments": "",
    "filterRanges": [
      [
        1520,
        1690
      ]
    ]
  },
  {
    "class": "Имины и оксимы",
    "group": "O–H  вал.",
    "range": "3600—2700",
    "intensity": "сильная",
    "comments": "",
    "filterRanges": [
      [
        2700,
        3600
      ]
    ]
  },
  {
    "class": "Имины и оксимы",
    "group": "O–H  деф.",
    "range": "1475—1315",
    "intensity": "",
    "comments": "Практическое значение отсутствует.",
    "filterRanges": [
      [
        1315,
        1475
      ]
    ]
  },
  {
    "class": "Азосоединения",
    "group": "N=N  вал.",
    "range": "1500—1400",
    "intensity": "очень слабая",
    "comments": "Отсутствует в высокосимметричных соединениях.",
    "filterRanges": [
      [
        1400,
        1500
      ]
    ]
  },
  {
    "class": "Нитрилы и изонитрилы",
    "group": "C≡N  вал.",
    "range": "2260—2240",
    "intensity": "средняя или сильная",
    "comments": "",
    "filterRanges": [
      [
        2240,
        2260
      ]
    ]
  },
  {
    "class": "Диазосоединения",
    "group": "N+≡N  вал.",
    "range": "2310—2130",
    "intensity": "средняя",
    "comments": "Частота зависит от аниона.",
    "filterRanges": [
      [
        2130,
        2310
      ]
    ]
  },
  {
    "class": "Диазосоединения",
    "group": "C=N+=N  вал.",
    "range": "2050—2010",
    "intensity": "очень сильная",
    "comments": "",
    "filterRanges": [
      [
        2010,
        2050
      ]
    ]
  },
  {
    "class": "Цианаты и изоцианаты",
    "group": "OC≡N  вал.",
    "range": "2260—2130",
    "intensity": "средняя или сильная",
    "comments": "",
    "filterRanges": [
      [
        2130,
        2260
      ]
    ]
  },
  {
    "class": "Цианаты и изоцианаты",
    "group": "C–O  вал.",
    "range": "1200—1080",
    "intensity": "сильная",
    "comments": "",
    "filterRanges": [
      [
        1080,
        1200
      ]
    ]
  },
  {
    "class": "Цианаты и изоцианаты",
    "group": "N=C=O  вал.  асим.",
    "range": "2280—2230",
    "intensity": "сильная",
    "comments": "",
    "filterRanges": [
      [
        2230,
        2280
      ]
    ]
  },
  {
    "class": "Цианаты и изоцианаты",
    "group": "N=C=O  вал.  сим.",
    "range": "1450—1380",
    "intensity": "слабая",
    comments: "",
    "filterRanges": [
      [
        1380,
        1450
      ]
    ]
  },
  {
    "class": "Тиоцианаты и тиоизоцианаты",
    "group": "SC≡N  вал.",
    "range": "2170—2130",
    "intensity": "средняя",
    "comments": "",
    "filterRanges": [
      [
        2130,
        2170
      ]
    ]
  },
  {
    "class": "Тиоцианаты и тиоизоцианаты",
    "group": "C–S  вал.",
    "range": "750—550",
    "intensity": "",
    "comments": "Часто две полосы.",
    "filterRanges": [
      [
        550,
        750
      ]
    ]
  },
  {
    "class": "Тиоцианаты и тиоизоцианаты",
    "group": "N=C=S  вал.  асим.",
    "range": "2200—2050",
    "intensity": "очень сильная",
    "comments": "Обычно две полосы, резонанс Ферми",
    "filterRanges": [
      [
        2050,
        2200
      ]
    ]
  },
  {
    "class": "Тиоцианаты и тиоизоцианаты",
    "group": "N=C=S  вал.  сим.",
    "range": "950—650",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        650,
        950
      ]
    ]
  },
  {
    "class": "Тиолы и сульфиды",
    "group": "S–H  вал.",
    "range": "2600—2540",
    "intensity": "слабая",
    "comments": "",
    "filterRanges": [
      [
        2540,
        2600
      ]
    ]
  },
  {
    "class": "Тиолы и сульфиды",
    "group": "S–H  деф.",
    "range": "915—800",
    "intensity": "слабая",
    "comments": "Практическое значение отсутствует.",
    "filterRanges": [
      [
        800,
        915
      ]
    ]
  },
  {
    "class": "Тиолы и сульфиды",
    "group": "C–S  вал.",
    "range": "710—570",
    "intensity": "слабая",
    "comments": "Практическое значение отсутствует.",
    "filterRanges": [
      [
        570,
        710
      ]
    ]
  },
  {
    "class": "Тиолы и сульфиды",
    "group": "S–S  вал.",
    "range": "≈500",
    "intensity": "слабая",
    "comments": "Практическое значение отсутствует.",
    "filterRanges": [
      [
        490,
        510
      ]
    ]
  },
  {
    "class": "Сульфоксиды и сульфоны",
    "group": "S=O  вал.",
    "range": "1225—980",
    "intensity": "сильная",
    "comments": "Иногда несколько полос.",
    "filterRanges": [
      [
        980,
        1225
      ]
    ]
  },
  {
    "class": "Сульфоксиды и сульфоны",
    "group": "SO2  вал.",
    "range": "1420—1000",
    "intensity": "очень сильная",
    "comments": "",
    "filterRanges": [
      [
        1000,
        1420
      ]
    ]
  },
  {
    "class": "Сульфоксиды и сульфоны",
    "group": "S–O  вал.",
    "range": "870—690",
    "intensity": "переменная",
    comments: "",
    "filterRanges": [
      [
        690,
        870
      ]
    ]
  },
  {
    "class": "Альдегиды",
    "group": "C–H  комб.",
    "range": "2900—2800, 2780—2680",
    "intensity": "слабая",
    "comments": "Резонанс Ферми.",
    "filterRanges": [
      [
        2800,
        2900
      ],
      [
        2680,
        2780
      ]
    ]
  },
  {
    "class": "Альдегиды",
    "group": "C=O  вал.",
    "range": "1765—1645",
    "intensity": "сильная",
    "comments": "Алифатические альдегиды дают полосу при 1740—1720 см–1. При наличии сопряжения частота колебания понижается: ароматические альдегиды (1710—1685), α,β-ненасыщенные альдегиды (1695—1660). Для α-галогенальдегидов эта частота выше (1765—1730).",
    "filterRanges": [
      [
        1645,
        1765
      ]
    ]
  },
  {
    "class": "Кетоны",
    "group": "C=O  вал.",
    "range": "1775—1650",
    "intensity": "сильная",
    "comments": "Алифатические кетоны дают полосу при 1715 см–1. Сопряжение смещает полосу в сторону более низких частот (ароматические кетоны: 1690, α,β-ненасыщенные кетоны: 1675). α-Дикетоны поглощают при 1720 см–1, β-дикетоны — при 1720 и 1650 см–1 (кетоформа и енольная форма соответственно).",
    "filterRanges": [
      [
        1650,
        1775
      ]
    ]
  },
  {
    "class": "Карбоновые кислоты",
    "group": "COO–H  вал.",
    "range": "3550—2500",
    "intensity": "переменная",
    "comments": "В сильно разбавленных растворах проявляется узкая полоса при 3550—3500 см–1. При образовании водородных связей частота понижается, а полоса уширяется.",
    "filterRanges": [
      [
        2500,
        3550
      ]
    ]
  },
  {
    "class": "Карбоновые кислоты",
    "group": "C=O  вал.",
    "range": "1800—1650",
    "intensity": "сильная",
    "comments": "Свободные группы поглощают при 1800—1740 см–1, при наличии водородных связей частота понижается до 1740—1650 см–1. α,β-Ненасыщенные карбоновые кислоты: 1715—1690 см–1, ароматические карбоновые кислоты: 1700—1680 см–1.",
    "filterRanges": [
      [
        1650,
        1800
      ]
    ]
  },
  {
    "class": "Сложные эфиры",
    "group": "C=O  вал.",
    "range": "1790—1650",
    "intensity": "сильная",
    "comments": "Алифатические сложные эфиры поглощают при 1750—1735 см–1, при сопряжении эта частота понижается (α,β-ненасыщенные сложные эфиры: 1730—1710, ароматические сложные эфиры: 1730—1715). α-Галогенпроизводные поглощают при 1790—1740 см–1.",
    "filterRanges": [
      [
        1650,
        1790
      ]
    ]
  },
  {
    "class": "Сложные эфиры",
    "group": "C–O  вал.",
    "range": "1330—1050",
    "intensity": "сильная",
    "comments": "Две полосы: полоса антисимметрического колебания с более высокой частотой и полоса симметрического колебания с меньшей частотой.",
    "filterRanges": [
      [
        1050,
        1330
      ]
    ]
  },
  {
    "class": "Амиды",
    "group": "N–H  вал.",
    "range": "3500—3100",
    "intensity": "средняя",
    "comments": "В первичных амидах две полосы.",
    "filterRanges": [
      [
        3100,
        3500
      ]
    ]
  },
  {
    "class": "Амиды",
    "group": "C=O  вал. (амид I)",
    "range": "1740—1630",
    "intensity": "сильная",
    "comments": "",
    "filterRanges": [
      [
        1630,
        1740
      ]
    ]
  },
  {
    "class": "Амиды",
    "group": "N–H  деф. и N–C=O  вал. (амид II)",
    "range": "1630—1510",
    "intensity": "сильная",
    "comments": "Полоса отсутствует в лактамах.",
    "filterRanges": [
      [
        1510,
        1630
      ]
    ]
  },
  {
    "class": "Ангидриды карбоновых кислот",
    "group": "C=O  вал.",
    "range": "1870—1770, 1800—1720",
    "intensity": "сильная",
    "comments": "Полосы симметричного и асимметричного колебания соответственно.",
    "filterRanges": [
      [
        1770,
        1870
      ],
      [
        1720,
        1800
      ]
    ]
  },
  {
    "class": "Ангидриды карбоновых кислот",
    "group": "C–O–C  вал.",
    "range": "1300—900",
    "intensity": "сильная",
    "comments": "Несколько полос.",
    "filterRanges": [
      [
        900,
        1300
      ]
    ]
  },
  {
    "class": "Галогенангидриды карбоновых кислот",
    "group": "C=O  вал.",
    "range": "1820—1750  вал.",
    "intensity": "сильная",
    "comments": "Характерна для хлорангидридов. Для бромангидридов или иодангидридов при более низкой частоте.",
    "filterRanges": [
      [
        1750,
        1820
      ]
    ]
  },
  {
    "class": "Галогенангидриды карбоновых кислот",
    "group": "C=O  вал.",
    "range": "1900—1870  вал.",
    "intensity": "сильная",
    "comments": "Фторангидриды.",
    "filterRanges": [
      [
        1870,
        1900
      ]
    ]
  },
  {
    "class": "Галогенангидриды карбоновых кислот",
    "group": "C–Hal  вал.",
    "range": "1200—500",
    "intensity": "",
    "comments": "Фторангидриды — 1200—800, хлорангидриды — 750—500, бромангидриды — 700—500, иодангидриды — 600—500.",
    "filterRanges": [
      [
        500,
        1200
      ]
    ]
  },
  {
    "class": "Кремнийорганические соединения",
    "group": "Si–H  вал.",
    "range": "2250—2090",
    "intensity": "средняя",
    "comments": "",
    "filterRanges": [
      [
        2090,
        2250
      ]
    ]
  },
  {
    "class": "Кремнийорганические соединения",
    "group": "Si–H  деф.",
    "range": "1010—700",
    "intensity": "сильная",
    "comments": "Обычно две широкие полосы.",
    "filterRanges": [
      [
        700,
        1010
      ]
    ]
  },
  {
    "class": "Кремнийорганические соединения",
    "group": "Si–O  вал.",
    "range": "1100—1000, 900—600",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        1000,
        1100
      ],
      [
        600,
        900
      ]
    ]
  },
  {
    "class": "Кремнийорганические соединения",
    "group": "Si–C  вал.",
    "range": "850—650",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        650,
        850
      ]
    ]
  },
  {
    "class": "Кремнийорганические соединения",
    "group": "Si–N  вал.",
    "range": "1250—830",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        830,
        1250
      ]
    ]
  },
  {
    "class": "Кремнийорганические соединения",
    "group": "Si–F  вал.",
    "range": "980—820",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        820,
        980
      ]
    ]
  },
  {
    "class": "Кремнийорганические соединения",
    "group": "Si–Cl  вал.",
    "range": "<625",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        0,
        625
      ]
    ]
  },
  {
    "class": "Фосфорорганические соединения",
    "group": "P–H  вал.",
    "range": "2440—2275",
    "intensity": "слабая или средняя",
    "comments": "",
    "filterRanges": [
      [
        2275,
        2440
      ]
    ]
  },
  {
    "class": "Фосфорорганические соединения",
    "group": "PO–H  вал.",
    "range": "2700—2650",
    "intensity": "слабая",
    "comments": "Очень широкая полоса.",
    "filterRanges": [
      [
        2650,
        2700
      ]
    ]
  },
  {
    "class": "Фосфорорганические соединения",
    "group": "POH  комб.",
    "range": "2300—2250",
    "intensity": "слабая",
    "comments": "Очень широкая полоса.",
    "filterRanges": [
      [
        2250,
        2300
      ]
    ]
  },
  {
    "class": "Фосфорорганические соединения",
    "group": "P–O  вал.",
    "range": "1260—855",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        855,
        1260
      ]
    ]
  },
  {
    "class": "Фосфорорганические соединения",
    "group": "P=O  вал.",
    "range": "1300—960",
    "intensity": "сильная",
    "comments": "",
    "filterRanges": [
      [
        960,
        1300
      ]
    ]
  },
  {
    "class": "Фосфорорганические соединения",
    "group": "P=N  вал.",
    "range": "1500—1170",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        1170,
        1500
      ]
    ]
  },
  {
    "class": "Фосфорорганические соединения",
    "group": "P–C  вал.",
    "range": "800—700",
    "intensity": "различная",
    "comments": "Практическое применение отсутствует.",
    "filterRanges": [
      [
        700,
        800
      ]
    ]
  },
  {
    "class": "Фосфорорганические соединения",
    "group": "P–H  деф.",
    "range": "1090—910",
    "intensity": "сильная",
    "comments": "",
    "filterRanges": [
      [
        910,
        1090
      ]
    ]
  },
  {
    "class": "Борорганические соединения",
    "group": "B–H  вал.",
    "range": "2640—2200",
    "intensity": "сильная",
    "comments": "",
    "filterRanges": [
      [
        2200,
        2640
      ]
    ]
  },
  {
    "class": "Борорганические соединения",
    "group": "B–O  вал.",
    "range": "1380—1310",
    "intensity": "очень сильная",
    "comments": "",
    "filterRanges": [
      [
        1310,
        1380
      ]
    ]
  },
  {
    "class": "Борорганические соединения",
    "group": "B–OH  вал.",
    "range": "3300—3200",
    "intensity": "",
    "comments": "Очень широкая полоса.",
    "filterRanges": [
      [
        3200,
        3300
      ]
    ]
  },
  {
    "class": "Борорганические соединения",
    "group": "B–N  вал.",
    "range": "1550—1330",
    "intensity": "очень сильная",
    "comments": "",
    "filterRanges": [
      [
        1330,
        1550
      ]
    ]
  },
  {
    "class": "Борорганические соединения",
    "group": "B–C  вал.",
    "range": "1240—620",
    "intensity": "сильная",
    "comments": "Для очень несимметричных молекул две полосы.",
    "filterRanges": [
      [
        620,
        1240
      ]
    ]
  },
  {
    "class": "Борорганические соединения",
    "group": "B–F  вал.",
    "range": "1500—800",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        800,
        1500
      ]
    ]
  },
  {
    "class": "Борорганические соединения",
    "group": "B–Cl  вал.",
    "range": "1100—650",
    "intensity": "",
    "comments": "",
    "filterRanges": [
      [
        650,
        1100
      ]
    ]
  }
];

export default data;
